{
  "projects": {
    "0" : {
      "title": "StartPup, Web Application",
      "image": "https://c1.staticflickr.com/3/2895/34088263375_0737a8727d_z.jpg",
      "description": "<h1><strong>StartPup</strong></h1><p><em>Grow a startup like raising a puppy.</em></p><h4><strong>Introduction</strong></h4><p>The project was a collaborative Hackathon project accomplished by me and four other students in a four day period. The purpose of developing this website is to envision a platform for people with brilliant ideas to find partners on funding startups as well as provide tools for tracking the growth of the company. The project was built on Angular 2, Firebase and utilize Twitter API.</p><p><a title=\"Screen Shot 2017-04-16 at 10.08.44 PM\" href=\"https://www.flickr.com/photos/142718048@N08/34088264145/in/dateposted-public/\" data-flickr-embed=\"true\" data-context=\"true\"><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://c1.staticflickr.com/3/2865/34088264145_638ceabbf1_z.jpg\" alt=\"Screen Shot 2017-04-16 at 10.08.44 PM\" width=\"320\" height=\"175\" /></a></p><p>&nbsp;</p><script src=\"//embedr.flickr.com/assets/client-code.js\" async=\"\" charset=\"utf-8\"></script><p style=\"text-align: center;\">A sample project detail page utilizing Twitter API</p><h4><strong>Team Mechanism</strong></h4><p>The team agreed on a minimal viable product at the beginning of development. During development, the team was divided into two pairs working on separate components of the project and a single worker usually working on exploring advanced features, and rotated the roles. I was responsible for developing the project component which including full CRUD functionalities for projects. I worked one day as a solo on implementing a WYSIWYG editor into the update component for the user, so providing the user some flexibility on editing. Other students have worked on creating the users component and CRUD functionalities for users and exploring features such as login authentication with Google Firebase. Since the team took effort in setting up a blueprint for the project, the final merge of our code turns out to be very smooth.&nbsp;</p><p><a title=\"Screen Shot 2017-04-16 at 10.08.12 PM\" href=\"https://www.flickr.com/photos/142718048@N08/34047855646/in/dateposted-public/\" data-flickr-embed=\"true\" data-context=\"true\"><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://c1.staticflickr.com/4/3956/34047855646_37c8840dba_z.jpg\" alt=\"Screen Shot 2017-04-16 at 10.08.12 PM\" width=\"320\" height=\"170\" /></a></p><script src=\"//embedr.flickr.com/assets/client-code.js\" async=\"\" charset=\"utf-8\"></script><p style=\"text-align: center;\">&nbsp;Embedded WYSIWYG editor</p><h4><strong>Challenges and Possible Improvements</strong></h4><p>The challenges I have faced in this project includes trying to deal with asynchronous issues, since components on pages requires data to be ready before they can load. There are still an asynchronous issue in this application that is causing page component not to load if possible future improvements could be made. Secondly, the database structure we agreed on as a team at the beginning of the project turns out to be not very ideal for a flattened database like Firebase, causing us some time to transform out the database.</p>"
    },
    "1": {
      "title": "AR Wall, Augmented Reality",
      "image":"https://c1.staticflickr.com/3/2895/34188090856_cd80555c3c_k.jpg",
      "description":"<h1>AR Wall&nbsp;</h1><p>A interdisplinary application using aumented reality.</p><p><strong>Introduction</strong></p><p>I initiated this project during my research assistantship at IMAGINE Lab, Center of GIS, Georgia Tech. This project was originated from the idea of building an augmented reality application that will assist civil engineering students and also building managers to have a direct preception of in-wall structures. The project now would successfuly run on Android devices and would display a mock in-wall structure upon detection of a mark on the wall.</p><p><strong>Responsibilities</strong></p><p>I interviewed people in the MEP department at Georgia Tech and building managers to determine the needs for this application. Functionality wise, I was in charge of actually building the 3D model of in-wall structures in 3ds Max and importing into Unity 3D to implement augmented reality function using Qualcomm Vuforia plugins. I also built a simple user interface through C# scripts. During the weekly lab meeting, I would brainstorm with my lab peers and features such as voice over for accessibility were based on my peers' suggestions.&nbsp;</p><p><strong>Future Improvements</strong></p><p>Possible future developments on this project could include building a database for the MEP documents for the in-wall structures and allow the application to access. A second possible implementation was to allow determination of user's location in building based on wifi connection so the application does not need to rely on mark on wall to show the corresponding structure.</p>"
    },
    "2": {
      "title": "cLover, Web Application",
      "image": "https://c1.staticflickr.com/3/2893/34188468916_5c837a76c9_k.jpg",
      "description": "<h1>cLover</h1><p><em>A dating website programming project</em></p><p><strong>Introduction</strong></p><p>The project was a group project I accomplished with four other three students at Epicodus, the coding bootcamp I studied at. The main idea of this project is to build a dating website that people can find people with shared interests and preferences. The project was built on Nancy framework and ran on local SQL server. The team includes four students: <a href=\"https://github.com/minhchan11\" target=\"_blank\">Minh</a>, a fashion design background student, <a href=\"https://github.com/NMead93\" target=\"_blank\">Nick</a>, a recent graduate from University of Washington, and <a href=\"https://github.com/jiwonk42\">Jiwon</a>, a sociology background student.&nbsp;</p><p><strong>Team Mechanism and My Responsibilities</strong></p><p>The team together came up with a database design that we all agreed on. Collaborating with Nick on the backend functionailities, I was incharge of building up CRUD functionalities for user images and also obtaining user-locations using Google Map API. Minh worked on the user-interaction design and Jiwon had worked on testing and database seeding.&nbsp;</p><p><strong>Challenges</strong></p><p>Teamwise our biggest challenge was encountered when trying to integrate the user-interface design, the Views, that Minh designed with our the Controllers Nick and I built. We needed to modified the Views that we built for testing the Controllers to adapt the UI design, which including combining multiple Views into one and completely redoing of Views. Due to this issue, we ran out of time of implementing the filter functionality that we originally planed to have, but we also learned from this experience the importance of planning out a minimal viable product.</p>"
    }

  }
}
